//*******************************************************************
//                                                                  *
//                  仿真系统的设备状态                              *
//                                                                  *
//*******************************************************************
//*******************************************************************
//                         状态转换图
//                                      Stop                        *
//                                      ︿ |                        *
//                                      | ﹀                        *
//      Initial  --- >  Config  --- >   Run  --- >  Login      *
//                                           < ---                 *
//                                                                  *
//*******************************************************************

namespace IP_Lab.Device.Enum
{
    public enum DeviceState
    {
        DEVICE_STATE_INITIALIZE,    // 设备刚刚从列表拖出，创建时
        DEVICE_STATE_CONFIG,        // 在服务器上生成了配置文件
        DEVICE_STATE_RUN,           // 设备已启动
        DEVICE_STATE_STOP,          // 设备已关闭
        DEVICE_STATE_LOGIN          // 用户已登录设备
    }
}
